#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖``
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/zemoso-int/tf-devops-zemoso-vpn-infra/runs/run-uqQXq4M8pWcesb2c

Waiting for the plan to start...

Terraform v0.15.4
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_vpc.z_sec_vpc: Refreshing state... [id=vpc-036ecaa99a2434947]
aws_subnet.z_sec_public_subnet: Refreshing state... [id=subnet-0ade9f0807dc3ce99]
aws_subnet.z_sec_private_subnet: Refreshing state... [id=subnet-0b11408d4ec118054]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_internet_gateway.dev_infra_ig will be created
  + resource "aws_internet_gateway" "dev_infra_ig" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-infra-ig"
          + "Owner"      = "terraform"
        }
      + vpc_id   = (known after apply)
    }

  # aws_route_table.dev_infra_public_rt will be created
  + resource "aws_route_table" "dev_infra_public_rt" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = "::/0"
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = (known after apply)
              + instance_id                = ""
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
      + tags             = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-infra-public-rt"
          + "Owner"      = "terraform"
        }
      + vpc_id           = (known after apply)
    }

  # aws_route_table_association.public_1_rt_a will be created
  + resource "aws_route_table_association" "public_1_rt_a" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # aws_subnet.dev_build_public_subnet will be created
  + resource "aws_subnet" "dev_build_public_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.21.10.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-build-public-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-build-public-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.dev_env_private_subnet will be created
  + resource "aws_subnet" "dev_env_private_subnet" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-2b"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.21.240.0/20"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-env-private-subnet"
          + "Owner"      = "terraform"
        }
      + tags_all                        = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-env-private-subnet"
          + "Owner"      = "terraform"
        }
      + vpc_id                          = (known after apply)
    }

  # aws_subnet.z_sec_private_subnet will be destroyed
  - resource "aws_subnet" "z_sec_private_subnet" {
      - arn                             = "arn:aws:ec2:us-east-2:365299945243:subnet/subnet-0b11408d4ec118054" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-2b" -> null
      - availability_zone_id            = "use2-az2" -> null
      - cidr_block                      = "10.20.30.0/24" -> null
      - id                              = "subnet-0b11408d4ec118054" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "365299945243" -> null
      - tags                            = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-private-subnet"
          - "Owner"      = "terraform"
        } -> null
      - tags_all                        = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-private-subnet"
          - "Owner"      = "terraform"
        } -> null
      - vpc_id                          = "vpc-036ecaa99a2434947" -> null
    }

  # aws_subnet.z_sec_public_subnet will be destroyed
  - resource "aws_subnet" "z_sec_public_subnet" {
      - arn                             = "arn:aws:ec2:us-east-2:365299945243:subnet/subnet-0ade9f0807dc3ce99" -> null
      - assign_ipv6_address_on_creation = false -> null
      - availability_zone               = "us-east-2a" -> null
      - availability_zone_id            = "use2-az1" -> null
      - cidr_block                      = "10.20.20.0/24" -> null
      - id                              = "subnet-0ade9f0807dc3ce99" -> null
      - map_customer_owned_ip_on_launch = false -> null
      - map_public_ip_on_launch         = false -> null
      - owner_id                        = "365299945243" -> null
      - tags                            = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-public-subnet"
          - "Owner"      = "terraform"
        } -> null
      - tags_all                        = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-public-subnet"
          - "Owner"      = "terraform"
        } -> null
      - vpc_id                          = "vpc-036ecaa99a2434947" -> null
    }

  # aws_vpc.dev_infra_vpc will be created
  + resource "aws_vpc" "dev_infra_vpc" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.21.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-infra-vpc"
          + "Owner"      = "terraform"
        }
      + tags_all                         = {
          + "Created_by" = "suraj"
          + "Name"       = "dev-infra-vpc"
          + "Owner"      = "terraform"
        }
    }

  # aws_vpc.z_sec_vpc will be destroyed
  - resource "aws_vpc" "z_sec_vpc" {
      - arn                              = "arn:aws:ec2:us-east-2:365299945243:vpc/vpc-036ecaa99a2434947" -> null
      - assign_generated_ipv6_cidr_block = false -> null
      - cidr_block                       = "10.20.0.0/16" -> null
      - default_network_acl_id           = "acl-08560e21c1ba2ff59" -> null
      - default_route_table_id           = "rtb-032c3ca297aeb9050" -> null
      - default_security_group_id        = "sg-0a017d36768295821" -> null
      - dhcp_options_id                  = "dopt-9070bff9" -> null
      - enable_dns_hostnames             = false -> null
      - enable_dns_support               = true -> null
      - id                               = "vpc-036ecaa99a2434947" -> null
      - instance_tenancy                 = "default" -> null
      - main_route_table_id              = "rtb-032c3ca297aeb9050" -> null
      - owner_id                         = "365299945243" -> null
      - tags                             = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-vpc"
          - "Owner"      = "terraform"
        } -> null
      - tags_all                         = {
          - "Created_by" = "suraj"
          - "Name"       = "z-sec-vpc"
          - "Owner"      = "terraform"
        } -> null
    }

Plan: 6 to add, 0 to change, 3 to destroy.


```

</details>

*Pusher: @suraj-zemoso, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*